# <font color='green'> SQL </font>

## <font color ='red'> Initialisation de la TABLE </font>

In [ ]:
CREATE TABLE LIVRES
    (id INT, titre TEXT, auteur TEXT, ann_publi INT, note INT, PRIMARY KEY (id));

Ceci va créer une table qui aura pour nom LIVRES et plusieurs attributs comme id, titre, auteur, ann_publi, note. Pour créer ces attributs nous avons précisé leur domaine. 

Il existe plusieurs domaines: 
- Pour id, ann_publi, note nous leur avons mis le domaine INT qui correspond à un entier
- Pour titre, auteur nous leur avons mis le domaine TEXT qui correspond à une chaine de caractères

Nous avons rajouté a id le rôle de clé primaire (PRIMARY KEY (id)). La clé primaire permet d'identifier chaque enregistrement dans une table de base de données. Et ne permet pas d'avoir des valeurs en doubles. Elle doit forcément contenir une valeur et ne doit surtout pas avoir de valeur NULL

#### Point Important en SQL il  faut que tout soit écrit en MAJUSCULE (hors les noms qu'ont donne aux attributs) et à chaque fin d'instruction il faut mettre une ;

In [ ]:
CREATE TABLE AUTEURS
(id INT, nom TEXT, prenom TEXT, ann_naissance INT, langue_ecriture TEXT, PRIMARY KEY (id));

In [ ]:
CREATE TABLE LIVRES
(id INT, titre TEXT, id_auteur INT, ann_publi INT, note INT, PRIMARY KEY (id), FOREIGN KEY (id_auteur) REFERENCES AUTEURS(id));

Dans cet exemple on créait une première TABLE que l'on nomme AUTEURS. Après on créait une deuxième TABLE que l'on nomme LIVRES.

Dans cette deuxième TABLE on crée plusieurs attributs. L'attribut id_auteur va servir de liaison entre id_auteur de la TABLE LIVRES avec id de la TABLE AUTEURS, grâce au domaine:
- FOREIGN KEY(id_auteur) REFERENCES AUTEURS(id)

In [ ]:
SELECT titre,nom, prenom
FROM LIVRES
INNER JOIN AUTEURS ON LIVRES.id_auteur = AUTEURS.id

La commande INNER JOIN AUTEURS ON LIVRES.id_auteurs = AUTEURS.id

va lier les deux TABLES entre elle car id_auteur est lié avec id lors de la création des deux TABLES

### <font color='blue'> Ajouter des données </font>

In [ ]:
INSERT INTO LIVRES
    (id,titre,auteur,ann_publi,note)
    VALUES
    (1,'1984','Orwell',1949,10);

Grâce à l'instruction suivante nous allons ajouter des données aux attributs de la table LIVRES. Dans l'exemple ci-contre on ajoute:
- à l'attribut id la valeur de 1 
- à l'attribut titre la valeur 1984 qui doit être compris entre '' car son domaine est chaine de caractère
- à l'attribut auteur la valeur Orwell qui doit être compris entre '' car son domaine est chaine de caractère
- à l'attribut ann_publi la valeur 1949 
- à l'attribut note la valeur 10 

Et une fois fini on a mis une ; pour annoncer qu'on avit fini d'ajouter des données à la table LIVRES 

On peut encore en ajouter mais cela ressemblera à cela:

In [ ]:
INSERT INTO LIVRES
    (id,titre,auteur,ann_publi,note)
    VALUES
    (1,'1984','Orwell',1949,10),
    (2,'Dune','Herbert',1965,8);

## <font color='red'> Interrogation Table </font>

### <font color='blue'> Restriction </font>

In [ ]:
SELECT id, titre, auteur, ann_publi, note
FROM LIVRES

Grâce à cet instruction on sélectionne les attributs de la table LIVRES et cela les fait apparaîtres dans un tableau où on ils apparaissent.

Mais on peut aussi choisir si l'on veut faire apparaitre que les id ou que le tritre, etc. Pour ce faire dans SELECT il suffit retirer l'attribut en question.

In [ ]:
SELECT titre, ann_publi
FROM LIVRES
WHERE auteur='Asimov'

Cet instruction va sélectionner les attributs titre, ann_publi de la table LIVRES 

Grâce à l'instruction WHERE on limite les attributs que l'on veut faire apparaitre à ceux dont la donnée à l'attributs auteurs est 'Asimov'.

In [ ]:
SELECT titre, ann_publi
FROM LIVRES
WHERE auteur='Asimov' AND ann_publi>1953

A la suite de l'instruction WHERE on rajoute l'instruction AND pour spécifier encore plus les attributs que l'on veut faire apparaitre. 

Dans cet exemple on va obtenir les livres écrit par Asimov après 1953

AND, OR et NOT sont des combinaisons de comparaison 

=, <> (symbole indiquant une non-égalité), >, >=, <, <= sont des opérateurs classiques d'organisation 

### <font color='blue'> Majuscule et Minuscule </font>

UPPER() et LOWER() font transformer une chaine en majuscule ou en minuscule aussi bien dans un WHERE que au niveau du SELECT lors de la concaténation

In [ ]:
SELECT * 
    FROM Employe
    WHERE UPPER(Ville) = "SEATTLE";

La commande LENGTH( ) permet de renvoyer la longueur de la chaîne a y compris les espaces

### <font color='blue'> Données manquantes</font>

IS NULL est une condition qui va tester la présence d'un attribut et que s'il est présent alors ne les affichera

In [ ]:
SELECT * 
    FROM Employe
    WHERE Region IS NULL;

IS NOT NULL est une condition qui va tester la présence d'un attribut et que s'il est présent alors n'affichera que ceux la

In [ ]:
SELECT * 
    FROM Employe
    WHERE Region IS NOT NULL;

### <font color ='blue'> Opérateur spécifique</font>

Les opérateurs spécifiques sont particulièrement utiles pour limiter la taille de la requête.

BETWEEN va permettre de définir un intervalle entre deux attributs

In [ ]:
SELECT * 
    FROM Employe
    WHERE NoEmp BETWEEN 3 AND 8;

Dans cet exemple on affiche que les lignes dont les NoEmp soit compris entre 3 et 8

IN va permettre de définir une liste de valeurs entre parenthèses et séparées par des virgules.

In [ ]:
SELECT * 
    FROM Employe
    WHERE TitreCourtoisie IN ('Mlle', 'Mme');

Dans cet exemple on affiche que les lignes dont les TitreCourtoisie sont Mlle ou Mme

LIKE  va permettre de comparer une chaîne de caractère à une pseudo-chaîne, dans laquelle nous pouvons ajouter deux caractères spécifiques :
- % : une suite de caractères, éventuellement nulle
- _ : un et un seul caractère

In [ ]:
SELECT * 
    FROM Employe
    WHERE Nom LIKE 'D%';

Dans cet exemple cette requête va permettre de récupérer les employés dont le nom commence par un "D".

### <font color='blue'>Organiser l'affichage</font>

In [ ]:
SELECT * 
    FROM Employe
    ORDER BY Nom;

ORDER BY va permettre de faire un tri de donnée, celui ne se fait que au moment de l'affichage (le tri est par défaut croissant)

In [ ]:
SELECT * 
    FROM Employe
    ORDER BY Nom DESC;

DESC va permettre de trier par ordre décroissant au moment de l'affichage


Si l'on veut mettre deux méthode de tri il faut utiliser une virgule "," pour séparer les deux critères de tri

In [ ]:
SELECT titre
FROM LIVRES
WHERE auteur='K.Dick' ORDER BY ann_publi

Dans cet exemple on a rajouté ORDER BY qui va permettre de trier de façon croissante par rapport aux domaines dont on veut. Cela va donner:

SELECT domaine 

FROM nom_table

WHERE domaine (qques chose) ORDER BY domaine

In [ ]:
SELECT *
FROM Client
LIMIT 3;

LIMIT va limiter le nombre de résultat en fonction du nombre que l'on aura mis suite au mot LIMIT 

Dans cet exemple nous avons demandé qu'il n'y ait que les 3 premières lignes qui apparaissent

Si l'on veut malgré tout ordonné ORDER BY devra être placé avant le LIMIT

DISTINCT juste après le SELECT, pour supprimer ces doublons.

### <font color='blue'> Renommage </font>

Avec le terme AS placé après l'attribut à renommer et suivi du nouveau nom.

In [ ]:
SELECT RefProd, 
        PrixUnit * UnitesStock AS "Montant en stock"
    FROM Produit;

Dans cet exemple on va multiplier PrixUnit avec UnitesStock que l'on renommera "Montant en stock"

### <font color='blue'> Jointure </font>

In [ ]:
SELECT titre,nom, prenom
    FROM LIVRES
    INNER JOIN AUTEURS ON LIVRES.id_auteur = AUTEURS.id

INNER JOIN va lier la TABLE LVRES et la TABLE AUTEURS. Mais pour faire cela il faut par avance lors de la création des TABLES faire la liaison avec un attribut qui sera sur les deux tables 

### <font color='blue'> Opération </font>

Il est possible de réaliser dans le SELECT des calculs arithmétiques grâce à des opérateurs tels quels: +, -, *, /, ().

In [ ]:
SELECT *, UnitesStock + UnitesCom
    FROM Produit;

Par exemple ici on va additionner les UnitesStock avec UnitesCom et ça affichera une colonne UnitesStock + UnitesCom où les résultats seront additionnés

### <font color='blue'> Calcul complexe </font>

Sont plus complexes à cause de l'utilisation de parenthèse "( )" cela ressemble à une expression mathématique tout ce qu'il y a de plus simple

Exemple ci-dessous :

In [ ]:
SELECT RefProd, 
        PrixUnit * (UnitesStock - 10)
    FROM Produit
    WHERE UnitesStock >= 10;

### <font color='blue'> Arrondi </font>

ROUND( ) va permettre d'arrondir l'attribut dont le domaine est un réel, celui ci doit se placer entre le SELECT et le FROM. 

Si l'on désire un arrondi à deux décimales, il faut ajouter un 2; exemple: ROUND(...., 2)

### <font color='blue'> Concaténations </font>

Pour réaliser la concaténation (sert a regrouper deux chaînes en une seule) il faut mettre ||. Il faut le placer comme ceci:  SELECT "Nom de la TABLE", "Nom de l'attribut 1" || "Nom de l'attribut 2". Malheuresement lors de l'affichege les deux chaines seront collés. Si l'on veut qu'elles soient décollé il faut faire | "  " |. 

#### <font color='purple'> Extraction d'une sous-chaîne </font>

La commande SUBSTR(chaîne, debut, longueur) cela va extraire de la chaîne les caractères dont on aura attribué le premier caractère dont on veut qu'il démarre avec la longueur que l'on veut qu'il ait 

Exemple:

In [ ]:
SELECT NoEmp, Nom || " " || SUBSTR(Prenom, 1, 1)
    FROM Employe;

Cela va faire apparaitre dans l'affichage une nouvelle colonne dont le Nom apparaitra en entier mais le Prénom aura que le 1er caractère 

Résultat type: Danzo A.

Mais si l'on veut que celui ci soit en MAJ il faut rajouter cela "." à la suite du SUBSTR(..., ..., ....) comme ceci pour notre exmple plus haut.

In [ ]:
SELECT NoEmp, Nom || " " || SUBSTR(Prenom, 1, 1) || "."
    FROM Employe;

### <font color='blue'> Recherche</font>

La commande INSTR(chaîne, sous-chaîne) elle va rechercher a quelle position se trouve la dernière occurence de la sous-chaîne. Si pas présente alors renvoie 0 et si présente alors renvoie le nombre d'occurence. Celle ci doit se retrouver entre le SELECT et le FROM

## <font color='red'> Modifier la TABLE </font>

### <font color='blue'> Modifier une sous-chaîne </font>

Pour cela il faut utiliser la commande REPLACE(chaîne, sous-chaîne1, sous-chaîne2) celle ci va remplacer la sous-chaîne1 par la sous-chaîne2

Exemple:

In [ ]:
SELECT Nom, Prenom, Fonction,
        REPLACE(Fonction, "Chef", "Responsable")
    FROM Employe;

Ici nous remplaçons les termes chef par celui de responsable dans la fonction

### <font color='blue'> Créer des dates </font>

Pour créer des dates il faut utiliser la commande DATE( ) et STRFTIME( ) pour obtenir des informations sur les dates

La commande DATE("now" ) se situeras juste après le SELECT celle ci apparaitra dans le format YYYY-MM-DD elle peut prendre des paramètres après le "now" pour modifier la date comme par exmple obtenir celle du jour précédent pour cela il faut faire

In [ ]:
SELECT DATE("now", "-1 day");

# pour obtenir celle du début de mois

SELECT DATE("now", "start of month", "-1 day");

La commande STRFTIME( ) se situeras après la commande DATE( ) AS "...." et on indique l'information que l'on souhaite récupérer par un % cela donnera:

In [ ]:
SELECT DATE("now") AS "Aujourd'hui",
        STRFTIME("%Y", "now") AS "Année",
        STRFTIME("%m", "now") AS "Mois",
        STRFTIME("%d", "now") AS "Jour",
        STRFTIME("%d/%m/%Y", "now") AS "Nouveau format";

Grâce au date nous pouvons calculer le nombre de temp qu'il s'est écoulé entre deux moment par exemple entre le 1er Janvier 2000 et aujourd'hui

### <font color = 'purple'> Ordre</font>

CREATE TABLE ...(... INT, ... TEXT, ... INT, PRIMARY KEY(...));

INSERT INTO ....(..., ..., ....) VALUES(..., ..., ...),(..., ..., ...).

SELECT *, ....+.....

FROM ..., 

WHERE ....,

ORDER BY .....,

LIMIT .....,